# -*- coding: utf-8 -*-

import jaconv

__CONVERSION = str.maketrans({
    'ゔ': 'う',
    'が': 'か', 'ぎ': 'き', 'ぐ': 'く', 'げ': 'け', 'ご': 'こ',
    'ざ': 'さ', 'じ': 'し', 'ず': 'す', 'ぜ': 'せ', 'ぞ': 'そ',
    'だ': 'た', 'ぢ': 'ち', 'づ': 'つ', 'で': 'て', 'ど': 'と',
    'ば': 'は', 'び': 'ひ', 'ぶ': 'ふ', 'べ': 'へ', 'ぼ': 'ほ',
    'ぱ': 'は', 'ぴ': 'ひ', 'ぷ': 'ふ', 'ぺ': 'へ', 'ぽ': 'ほ',
    'ぁ': 'あ', 'ぃ': 'い', 'ぅ': 'う', 'ぇ': 'え', 'ぉ': 'お',
    'っ': 'つ',
    'ゃ': 'や', 'ゅ': 'ゆ', 'ょ': 'よ'
})


def normalize_kana(x: str) -> str:
    """
    日本語の辞書順に合うように文字列を変換
    ひらがな・カタカナまで
    伸ばし棒は母音扱いするらしいが変換が面倒なので省略
    """
    o = jaconv.kata2hira(jaconv.normalize(x)).translate(__CONVERSION)
    return o
